OpenDTEF-v1812/tutorials/incompressible/pimpleFoam/RAS/ellipsekkLOmega/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication transformPoints -scale '(1.6666 1 1)'

runApplication -s xplane mirrorMesh -dict system/mirrorMeshDict.X -overwrite
runApplication -s yplane mirrorMesh -dict system/mirrorMeshDict.Y -overwrite

restore0Dir

runApplication topoSet

runApplication createPatch -overwrite

runApplication surfaceMeshTriangulate \
    -patches hole ppGeometry.vtp -constant -time none

echo "End"

#------------------------------------------------------------------------------
